{
  "backend/main.mo": "Main backend actor defining fantasy cricket types (Player, Match, FantasyTeam, Contest, UserProfile, WalletTransaction) and implementing core functions for user profiles, team creation with validation (11 players, credit limits, role constraints), contest management, wallet operations, and Stripe payment integration with authorization controls.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (user authentication, match listing, team creation, contest entry, leaderboard, wallet/payments) to their corresponding frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/TSX files describing components for routing, layout, match display, team building, contests, leaderboard, wallet management, and payment flows.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for backgrounds, foregrounds, borders, and component-specific colors.",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application titled 'Skill11 Fantasy'.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for matches, team creation, contests, leaderboard, wallet, and payment pages, integrating profile setup modal and payment setup for authenticated users.",
  "frontend/src/components/ContestCard.tsx": "Card component displaying contest details (prize pool, entry fee, spots filled/total) with progress bar and conditional buttons for joining contests or viewing leaderboard based on participation status.",
  "frontend/src/components/ContestList.tsx": "Component fetching and displaying contests filtered by ₹10-₹100 entry fee range, showing wallet balance, handling contest joins via team selection modal, and navigating to leaderboards.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (Matches, Wallet), Internet Identity authentication, and mobile-responsive hamburger menu. Handles login/logout flow and navigation.",
  "frontend/src/components/Leaderboard.tsx": "Displays contest leaderboard with sorted participants by points, prize pool info, entry fee, spots filled, and highlights current user's rank. Shows loading and empty states.",
  "frontend/src/components/LeaderboardRow.tsx": "Individual leaderboard entry showing rank (with trophy icons for top 3), team ID, owner principal, points, and optional prize amount. Highlights current user's row.",
  "frontend/src/components/MatchCard.tsx": "Card displaying match details (teams, venue, date/time, status) with buttons to create team or view contests. Disables team creation after match starts.",
  "frontend/src/components/MatchList.tsx": "Fetches and displays all matches grouped by status (live, upcoming, completed) in a responsive grid layout with loading and empty states.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only modal for configuring Stripe payment integration with secret key and allowed countries. Only shown to admins when Stripe is not yet configured.",
  "frontend/src/components/PlayerCard.tsx": "Selectable player card showing name, team, position, credits, and selection state with captain/vice-captain indicators. Supports disabled state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Mandatory modal for new users to complete profile with name (required), email, and phone number. Cannot be dismissed until profile is created.",
  "frontend/src/components/TeamBuilder.tsx": "React component for building a fantasy cricket team with player selection, position constraints (11 players total with specific limits per role), credit budget management (max 100), and captain/vice-captain assignment.",
  "frontend/src/components/TeamSelectionModal.tsx": "Modal dialog component that allows users to select from their existing fantasy teams to join a contest, displays entry fee and wallet balance, and handles the contest join action.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a list of wallet transactions (deposits, contest entry fees, winnings) with icons, timestamps, and formatted amounts showing credits/debits.",
  "frontend/src/components/WalletBalance.tsx": "Card component that displays the user's current wallet balance with a wallet icon and loading state.",
  "frontend/src/components/WalletRecharge.tsx": "Form component for adding funds to wallet (₹10-₹10,000 range) that creates a Stripe checkout session and redirects to payment page.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating data including user profiles, matches, players, fantasy teams, contests, wallet operations, and shopping items. Each hook uses the actor from useActor and manages query/mutation state with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming including cricket green, energy orange, vibrant red, and trophy gold color palettes. Defines both light and dark mode color schemes with base styles for typography.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/ContestsPage.tsx": "Displays available contests for a specific match with navigation back to matches list. Shows match details in a header and renders the ContestList component.",
  "frontend/src/pages/CreateTeamPage.tsx": "Page for creating a fantasy team for a specific match using the TeamBuilder component. Handles team submission and navigates to contests page on success.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays the leaderboard for a specific contest with navigation back to matches. Renders the Leaderboard component for the given contestId.",
  "frontend/src/pages/MatchesPage.tsx": "Home page displaying a hero banner with branding and the MatchList component showing available cricket matches for fantasy contests.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure screen with error message and action buttons to retry payment or return to matches page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that invalidates wallet queries, shows success toast, and provides navigation to wallet or matches pages.",
  "frontend/src/pages/WalletPage.tsx": "Wallet management page displaying balance, recharge options, and transaction history with navigation back to matches.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space (including cricket-green, energy-orange, vibrant-red, trophy-gold palettes), container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for Skill11 Fantasy, a mobile-first IPL fantasy cricket app with low-entry contests (₹10–₹100), tracking implemented features including user authentication, match listings, team creation, contest entry, payment integration, live scoring, leaderboards, and wallet management."
}